# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [4]:
# Your code here:
salaries = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [14]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [8]:
# Your code here:
salaries.isna().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [10]:
# Your code here:
salaries['Salary or Hourly'].value_counts()

Salary    25161
Hourly     8022
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [12]:
# Your code here:
salaries.groupby('Department')['Name'].count()

Department
ADMIN HEARNG                39
ANIMAL CONTRL               81
AVIATION                  1629
BOARD OF ELECTION          107
BOARD OF ETHICS              8
BUDGET & MGMT               46
BUILDINGS                  269
BUSINESS AFFAIRS           171
CITY CLERK                  84
CITY COUNCIL               411
COMMUNITY DEVELOPMENT      207
COPA                       116
CULTURAL AFFAIRS            65
DISABILITIES                28
DoIT                        99
FAMILY & SUPPORT           615
FINANCE                    560
FIRE                      4641
GENERAL SERVICES           980
HEALTH                     488
HUMAN RELATIONS             16
HUMAN RESOURCES             79
INSPECTOR GEN               87
LAW                        407
LICENSE APPL COMM            1
MAYOR'S OFFICE              85
OEMC                      2102
POLICE                   13414
POLICE BOARD                 2
PROCUREMENT                 92
PUBLIC LIBRARY            1015
STREETS & SAN             2198
TRANSPORTN                1140
TREASURER                   22
WATER MGMNT               1879
Name: Name, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [29]:
# Your code here:
from scipy.stats import ttest_1samp
ttest_1samp(salaries['Hourly Rate'], 30, nan_policy='omit')

Ttest_1sampResult(statistic=20.619805785494147, pvalue=4.323024048614701e-92)

In [ ]:
"""
p-value < 0.05 so the null hypothesis is rejected, means that the hourly wage is indeed significantly different from $30/h
"""

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [40]:
# Your code here:
t_statistics, p_value = ttest_1samp(salaries['Annual Salary'], 86000, nan_policy='omit')

In [43]:
t_statistics, p_value

(5.932870515690814, 3.015758519929416e-09)

In [42]:
p_value/2

1.507879259964708e-09

In [ ]:
"""
p-value/2 < 0.05 so the null hypothesis is rejected, means that the salaries this year are indeed higher than last year
(> $86000)
"""

Using the `crosstab` function, find the department that has the most hourly workers.

In [70]:
# Your code here:
cross_tab = pd.crosstab(data['Department'], data['Salary or Hourly'])
cross_tab.head()

Salary or Hourly   Hourly  Salary
Department
ADMIN HEARNG            0      39
ANIMAL CONTRL          19      62
AVIATION             1082     547
BOARD OF ELECTION       0     107
BOARD OF ETHICS         0       8

In [71]:
cross_tab.reset_index(inplace=True)

In [72]:
cross_tab[cross_tab['Hourly'] == cross_tab['Hourly'].max()]

Salary or Hourly     Department  Hourly  Salary
31                STREETS & SAN    1862     336

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [78]:
# Your code here:
streets_san = salaries[salaries['Department'] == 'STREETS & SAN']
streets_san.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
21,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,21.43
24,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
36,"ABRAMS, DANIELLE T",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,36.21
39,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60

In [79]:
t_statistics, p_value = ttest_1samp(streets_san['Hourly Rate'], 35, nan_policy='omit')

In [80]:
t_statistics, p_value

(-9.567447887848152, 3.337853056471074e-21)

In [81]:
p_value/2

1.668926528235537e-21

In [ ]:
"""
p-value/2 < 0.05 so the null hypothesis is rejected, means that the hourly wage is indeed less than $35/h
"""

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [110]:
# Your code here:
from scipy.stats import t
from scipy.stats import sem

alpha = 0.95
df = len(salaries)-1 # all rows or only the non null ones?
loc = salaries['Hourly Rate'].mean()
scale = sem(salaries['Hourly Rate'], ddof=1, nan_policy='omit')

t.interval(alpha, df, loc, scale)

(32.52348867934239, 33.05362675322017)

In [109]:
# option to calculat the std:
# np.std(salaries['Hourly Rate'], ddof=1) / (8022**0.5)
# 8022 are the non null values

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [111]:
# Your code here:
alpha = 0.95
df = len(salaries)-1 # all rows or only the non null ones?
loc = salaries['Annual Salary'].mean()
scale = sem(salaries['Annual Salary'], ddof=1, nan_policy='omit')

t.interval(alpha, df, loc, scale)

(86526.99959172717, 87046.99998857589)

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [137]:
# Your code here:
from statsmodels.stats.proportion import proportions_ztest

proportions_ztest(count=len(salaries[salaries['Salary or Hourly'] == 'Hourly']), # count = nr of 'Hourly'
                  nobs=len(salaries['Salary or Hourly']),
                  value=0.25)

(-3.5099964213703005, 0.0004481127249057967)

In [ ]:
"""
p-value < 0.05 so the null hypothesis is rejected, means that the porportion of hourly workers in Chicago is indeed
significantly different from 25%
"""

In [129]:
salaries['Salary or Hourly'].value_counts('Hourly')

Salary    0.75825
Hourly    0.24175
Name: Salary or Hourly, dtype: float64